# IsWellConnected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystem..::..IsWellConnected Property
PipingSystem Class See Also
---
Indicates if the system is well connected or not.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsWellConnected { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsWellConnected As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsWellConnected {
	bool get ();
}
```

# Remarks
If the system is not well connected, parameters which need to be calculated are invalid.
# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace